In [2]:
## reading files in pandas  excel , website

In [2]:
sales = [10,20,30,40,50]
agents = ["deji","daniel","deji","daniel","deji"]

In [3]:
### Groupby

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame({"sale":sales,"agent":agents})

In [6]:
df

   sale   agent
0    10    deji
1    20  daniel
2    30    deji
3    40  daniel
4    50    deji

In [7]:
df.groupby("agent").sum()

        sale
agent
daniel    60
deji      90

In [8]:
df.groupby("agent").mean()

        sale
agent
daniel  30.0
deji    30.0

In [9]:
df.groupby("agent").count()

        sale
agent
daniel     2
deji       3

In [10]:
### value count , info , shape , describe

In [11]:
df

   sale   agent
0    10    deji
1    20  daniel
2    30    deji
3    40  daniel
4    50    deji

In [12]:
df["agent"].value_counts()

agent
deji      3
daniel    2
Name: count, dtype: int64

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sale    5 non-null      int64
 1   agent   5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [14]:
df.shape

(5, 2)

In [15]:
df

   sale   agent
0    10    deji
1    20  daniel
2    30    deji
3    40  daniel
4    50    deji

In [16]:
df.describe()

            sale
count   5.000000
mean   30.000000
std    15.811388
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    50.000000

In [17]:
### How to read files using pandas

In [18]:
location = "C:/Users/OWNER/Desktop/demofile.xlsx"

In [19]:
import pandas as pd

In [20]:
df1 = pd.read_excel("C:/Users/OWNER/Desktop/demofile.xlsx")

In [21]:
df1

     name   age   gender
0     deji    20    male
1    funke    10  female
2   daniel    28    male
3  raphael    23    male
4     bola    21  female

In [22]:
df1.columns

Index(['name ', 'age ', 'gender'], dtype='object')

In [23]:
df1['name '].value_counts()

name
deji       1
funke      1
daniel     1
raphael    1
bola       1
Name: count, dtype: int64

In [24]:
df1["gender"].value_counts()

gender
male      3
female    2
Name: count, dtype: int64

In [25]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   gender  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [26]:
df1.describe()

            age
count   5.000000
mean   20.400000
std     6.580274
min    10.000000
25%    20.000000
50%    21.000000
75%    23.000000
max    28.000000

In [27]:
df1.describe(include="object")

       name  gender
count      5      5
unique     5      2
top     deji   male
freq       1      3

In [55]:
### how to read tables online

In [28]:
import pandas as pd

In [34]:
table = pd.read_html("https://www.skysports.com/la-liga-table")

In [37]:
len(table)

1

In [36]:
table[0]

,Position,Team Team,Pl Played,W Won,D Drawn,L Lost,F Goals For,A Goals Against,GD Goal Difference,Pts Points
0,1,Barcelona,1,1,0,0,3,0,3,3
1,2,Rayo Vallecano,1,1,0,0,3,1,2,3
2,3,Villarreal,1,1,0,0,2,0,2,3
3,4,Getafe,1,1,0,0,2,0,2,3
4,5,Athletic Bilbao,1,1,0,0,3,2,1,3
5,6,Alaves,1,1,0,0,2,1,1,3
6,7,Espanyol,1,1,0,0,2,1,1,3
7,8,Real Madrid,1,1,0,0,1,0,1,3
8,9,Elche,1,0,1,0,1,1,0,1
9,10,Real Betis,1,0,1,0,1,1,0,1
10,11,Valencia,1,0,1,0,1,1,0,1
11,12,Real Sociedad,1,0,1,0,1,1,0,1
12,13,Sevilla,1,0,0,1,2,3,-1,0
13,14,Levante,1,0,0,1,1,2,-1,0
14,15,Atletico Madrid,1,0,0,1,1,2,-1,0
15,16,Osasuna,1,0,0,1,0,1,-1,0
16,17,Girona,1,0,0,1,1,3,-2,0
17,18,Celta Vigo,1,0,0,1,0,2,-2,0
18,19,Real Oviedo,1,0,0,1,0,2,-2,0
19,20,Real Mallorca,1,0,0,1,0,3,-3,0

In [30]:
!pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: six>=1.9 in c:\users\owner\anaconda3\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\owner\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
Installing collected packages: html5lib
Successfully installed html5lib-1.1